---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.IsWorkPlaneFlipped
zh: 族实例
source: html/33d135c3-d887-c574-a049-f8abdcb01ded.htm
---
# Autodesk.Revit.DB.FamilyInstance.IsWorkPlaneFlipped Property

**中文**: 族实例

Identifies if the instance's work plane is flipped.

## Syntax (C#)
```csharp
public bool IsWorkPlaneFlipped { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - Work plane cannot be flipped for this instance.